print(
    "здравствуй, добрый молодец!!!ты попал в игру Clash Royale\n"
    "пришло время выбирать орудие волар бб[0] элиточки[1]"
)


a = int(input())


if a == 0:
    print(
        "отлично\n"
        "идём дальше"
    )
elif a == 1:
    print(
        "хорошо\n"
        "идём дальше"
    )

print(
    "вы мило шли по лесу нечего не предвещало беды\n"
    "как вдруг на вас нападает (даня волар бб)он кидает свою карту\n"
    "выберете действие задефать[0] или кинуть меганайта с эволкой+клон[1]"
)


f = int(input())

if f == 0:
    print(
        "зачем? ну ладно\n"
        "идём дальше"
    )
elif f == 1:
    print(
        "хорош\n"
        "идём дальше"
    )


print(
    "последняя стадия X7 элика тебя закидывают твои действия\n"
    "ливнуть из игры[1] или ливнуть из игры[0]\n"
      )


v = int(input())


if v == 0:
    print(
    "не получается телефон потехоньку нагревается"
    )
elif v == 1:
    print(
    "не получается телефон потехоньку нагревается"
    )
print("у тебя загорелся телефон🔥🔥🔥")

print(
    "у тебя есть выбор кинуть телефон в реку[1] или кинуть в циганский табор[0]"

)

h = int(input())


if h == 0:
    print(
    "отлично Rampage ты спасся"
    )
elif h == 1:
    print(
    "отлично ты спасся"
    )


